In [27]:
import pandas as pd #importing
import random as random

train = pd.read_csv("train.csv")

In [28]:
train = pd.read_csv("train.csv") #reading train in

In [29]:
id_values = train['PassengerId'] # setting ID to a varible

In [30]:
maxvalue = id_values.max()
print ("the max is",id_values.max()) # Print max value

the max is 891

In [31]:
minvalue = id_values.min()
print ("the min is", id_values.min()) #print min value

the min is 1

In [32]:
print ("the mean is", id_values.mean()) #print mean value. Range value is [1,891] inclusive

the mean is 446.0

In [33]:
my_newly_copied_dataframe = train # copying the dataframe

In [39]:
randomnum = random.randint(minvalue,maxvalue)
print (randomnum) # printing a number between min and max

125

In [45]:
rowfound = my_newly_copied_dataframe.iloc[randomnum] # find the data related to the random entry
print(rowfound) # print the row found
my_newly_copied_dataframe.drop(randomnum, axis=0) #delete the random entry

PassengerId                             126
Survived                                  1
Pclass                                    3
Name           Nicola-Yarred, Master. Elias
Sex                                    male
Age                                      12
SibSp                                     1
Parch                                     0
Ticket                                 2651
Fare                                11.2417
Cabin                                   NaN
Embarked                                  C
Name: 125, dtype: object

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [69]:
rowtoinsert = ['892','1','1','Duncan,Mr.James','male','20','0','0','400000','71','C30','S']
print(rowtoinsert)
my_newly_copied_dataframe.append(rowtoinsert)
my_newly_copied_dataframe.max()

['892', '1', '1', 'Duncan,Mr.James', 'male', '20', '0', '0', '400000', '71', 'C30', 'S']

PassengerId                            891
Survived                                 1
Pclass                                   3
Name           van Melkebeke, Mr. Philemon
Sex                                   male
Age                                     80
SibSp                                    8
Parch                                    6
Ticket                           WE/P 5735
Fare                               512.329
dtype: object